
[DataModel_Number of Valid CAs per Host]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = visualizations
display.visualizations.charting.legend.placement = none
request.ui_dispatch_app = casa
request.ui_dispatch_view = pivot
search = | pivot Certificate_Authorities Certificate_Authority_Stores dc(Thumbprint) AS "Distinct Count of Thumbprint" SPLITROW host AS Host FILTER Expired = false SORT 10000 host ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 0 SHOWOTHER 1

[CAs Using Recommended Algorithms/Key Sizes - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Certificate_Authority_Stores.Recommended_Algorithm | rename X509_Certificate_Standard.Certificate_Authority_Stores.Recommended_Algorithm AS "Recommended Algorithm/Key Size" dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs"

[Validity of Intermediate CAs by Country - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) AS dcount FROM datamodel=Certificate_Authorities where earliest=-7d X509_Certificate_Standard.StoreName="CA" X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Issuing_Country, X509_Certificate_Standard.Certificate_Authority_Stores.Years_of_Validity\
| search X509_Certificate_Standard.Certificate_Authority_Stores.Years_of_Validity > 10\
| xyseries X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Issuing_Country X509_Certificate_Standard.Certificate_Authority_Stores.Years_of_Validity dcount\
| rename X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Issuing_Country AS "Issuing Country" dcount AS "Number of CAs" X509_Certificate_Standard.Certificate_Authority_Stores.Years_of_Validity AS "Years of Validity"

[Country of Origin - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Issuing_Country | rename X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Issuing_Country AS "Issuing Country" dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs"

[Status of Trusted CAs - Data Model]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = bar
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Certificate_Authority_Stores.White_Black_List_Status | rename dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs" X509_Certificate_Standard.Certificate_Authority_Stores.White_Black_List_Status AS Status

[Previously Unseen CAs - Data Model]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(host) FROM datamodel=Certificate_Authorities where (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Thumbprint, X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest \
| dedup X509_Certificate_Standard.Thumbprint sortby -X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest\
| search X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest < 183\
| sort X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest\
| table X509_Certificate_Standard.Thumbprint, dc(host), X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest\
| rename X509_Certificate_Standard.Thumbprint AS Thumbprint dc(host) AS "Number of Hosts" X509_Certificate_Standard.Certificate_Authority_Stores.Days_Since_Event_Ingest AS "Days Since First Seen"

[Hosts with More than 200 CAs - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 1446209600.000
dispatch.latest_time = 1446818001.978
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) AS dcount FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by host | eval more=if(dcount>200,"More than 200","Less than 200") | stats count by more | rename count AS "Total Number of Hosts" more AS "Number of CAs"

[Default vs. Non-Default - Data Model]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
auto_summarize.dispatch.earliest_time = -7d@d
dispatch.earliest_time = 1446209600.000
dispatch.latest_time = 1446818002.009
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") by X509_Certificate_Standard.Certificate_Authority_Stores.Default_Status | rename dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs" X509_Certificate_Standard.Certificate_Authority_Stores.Default_Status AS Status

[Default vs. Non-Default per Host - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 1446206400.000
dispatch.latest_time = 1446818002.025
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart.stackMode = stacked
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by host, X509_Certificate_Standard.Certificate_Authority_Stores.Default_Status | xyseries host X509_Certificate_Standard.Certificate_Authority_Stores.Default_Status dc(X509_Certificate_Standard.Thumbprint) | rename dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs" X509_Certificate_Standard.Certificate_Authority_Stores.Default_Status AS Status host AS Host

[Commonality of Number of Unique CAs per Host - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 1446209600.000
dispatch.latest_time = 1446818002.306
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) AS dcount FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by host | stats count by dcount | sort dcount | rename count AS "Number of Hosts", dcount AS "Number of Unique CAs"

[Hosts per CA - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(host) AS "Number of Hosts" FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.Thumbprint | rename X509_Certificate_Standard.Thumbprint AS Thumbprint

[Whitelist/Blacklist/Graylist - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.visualizations.show = 0
request.ui_dispatch_app = casa
request.ui_dispatch_view = pivot
search = | pivot Certificate_Authorities Certificate_Authority_Stores values(ssl_issuer) AS "Issuer" values(ssl_subject) AS "Subject" values(White_Black_List_Status) AS "Status" SPLITROW Thumbprint AS Thumbprint FILTER Expired = false SORT 10000 Thumbprint ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 0 SHOWOTHER 1

[Invalid Trust Chain - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats values(X509_Certificate_Standard.Issuer) AS Issuers FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") by X509_Certificate_Standard.Thumbprint | rename X509_Certificate_Standard.Thumbprint AS Thumbprint | where mvcount(Issuers)>1 | mvexpand Issuers

[Time to Expiration - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.axisY2.scale = log
display.visualizations.charting.chart = bar
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats count FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") by X509_Certificate_Standard.Thumbprint, X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration\
| eval timeRange=case('X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'>=120, "More than 120 Days", 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'<120 AND 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'>=90, "90-120 Days", 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'<90 AND 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'>=60, "60-90 Days", 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'<60 AND 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'>=30, "30-60 Days", 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'<30 AND 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'>0, "Less than 30 Days", 'X509_Certificate_Standard.Certificate_Authority_Stores.Days_Until_Expiration'<=0, "Expired")\
| stats dc(X509_Certificate_Standard.Thumbprint) by timeRange | sort +timeRange | rename dc(X509_Certificate_Standard.Thumbprint) AS "Number of CAs" timeRange AS  "Time Range"

[CA Algorithms]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now()  | eval timeDiff=ed2-now | where timeDiff>0  | eval Public_Key_Size=coalesce(Public_Key_Size, "Unknown") | chart dc(Thumbprint) by ssl_signature_algorithm, Public_Key_Size

[CAs Using Recommended Algorithms/Key Sizes]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff > 0 \
| rex field=ssl_signature_algorithm "\w+?(?P<hashAlgSize>\d+)\w+" \
| eval recommended=case(Public_Key_Algorithm=="RSA" AND hashAlgSize >= 256 AND Public_Key_Size>= 2048, "Recommended", Public_Key_Algorithm=="ECC" AND hashAlgSize >= 384 AND Encoded_Key_Parameters=="06 05 2B 81 04 00 22", "Recommended", Public_Key_Algorithm=="ECC" AND hashAlgSize >= 256 AND Encoded_Key_Parameters=="06 08 2A 86 48 CE 3D 03 01 07", "Recommended", Public_Key_Algorithm=="ECC" AND isnull(Encoded_Key_Parameters), "Unknown", 1=1, "Not Recommended")\
| chart dc(Thumbprint) by recommended\
| rename recommended AS "Recommended Algorithm/Key Size" dc(Thumbprint) AS "Number of CAs"

[Commonality of Number of Unique CAs per Host]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | stats dc(Thumbprint) AS dcount by host| stats count by dcount | rename count AS "Number of Hosts", dcount AS "Number of Unique CAs"

[Certificate Details]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now()  | eval timeDiff=ed2-now | where timeDiff>0  | table host, ssl_subject, ssl_issuer, ssl_start_time, ssl_end_time, Thumbprint, ssl_signature_algorithm, ssl_publickey_algorithm, Public_Key_Size, ssl_publickey | rename host AS "Host", ssl_signature_algorithm as "Signature Algorithm", ssl_publickey_algorithm as "Key Algorithm", Public_Key_Size as "Key Size", ssl_publickey as "Raw Key Value", ssl_subject as Subject, ssl_issuer as Issuer, ssl_start_time as "Not Valid Before", ssl_end_time as "Not Valid After"

[Country of Origin]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | rex field=ssl_issuer "C=(?<Country>[a-zA-Z]*)" | eval Country=coalesce(upper(Country), "UNKNOWN") | stats dc(Thumbprint) by Country | rename dc(Thumbprint) AS "Number of CAs"

[Default vs. Non-Default]
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -7d@d
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | lookup DefaultCAList.csv "SHA-1 Fingerprint" AS Thumbprint | eval Status=if(isnull(Browser),"Non-default","Default") \
| eval govCA=if(match(ssl_subject,"U\.S\. Government"), "True","False")\
| lookup "Default CA List" "SHA-1 Fingerprint" AS Thumbprint | eval Status=case(govCA=="True","US Government",isnull(Browser) AND Status=="Default","No Longer Default",isnull(Browser) AND Status!="Default","Non-default",1=1,"Default") | chart dc(Thumbprint) AS "Number of CAs" by Status

[Default vs. Non-Default per Host]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart.stackMode = stacked
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now()  | eval timeDiff=ed2-now | where timeDiff>0\
| eval govCA=if(match(ssl_subject,"U\.S\. Government"), "True","False")\
| lookup DefaultCAList.csv "SHA-1 Fingerprint" AS Thumbprint | eval n=if(isnull(Browser),"Non-default","Default") \
| lookup "Default CA List" "SHA-1 Fingerprint" AS Thumbprint | eval n=case(govCA=="True","US Government",isnull(Browser) AND n=="Default","No Longer Default",isnull(Browser) AND n!="Default","Non-default",1=1,"Default") \
| chart dc(Thumbprint) by host, n | rename dc(Thumbprint) AS "Number of CAs" host AS "Host"

[Hosts per CA]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.tab = visualizations
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | stats dc(host) AS "Number of Hosts" by Thumbprint

[Hosts with More than 200 CAs]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.chart = pie
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | stats dc(Thumbprint) AS dcount by host | eval more=if(dcount>200,"More than 200","Less than 200") | stats count by more | rename count AS "Total Number of Hosts" more AS "Number of Unique CAs"

[Invalid Trust Chain]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | chart values(ssl_issuer) AS "Issuers" by Thumbprint | where mvcount(Issuers)>1 | mvexpand Issuers

[Number of CAs per Host]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | stats dc(Thumbprint) by host | rename dc(Thumbprint) AS "Number of CAs" host AS "Host"

[Previously Unseen CAs]
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
display.general.timeRangePicker.show = 0
display.page.search.mode = fast
display.visualizations.charting.chart = bar
search = tag=certificate_index tag=certificate_source tag=certificate_authority | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval time=_time | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 | eval days=ceil((now-time)/86400) | stats dc(host) by Thumbprint, days | dedup Thumbprint sortby -days | where days<=183 | table Thumbprint, dc(host), days | sort days | rename days AS "Days Since First Seen" dc(host) AS "Number of Hosts"

[Time to Expiration]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = bar
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval daysToExpire=(strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") - now()) / 86400 \
| eval timeRange=case(daysToExpire>=120, "More than 120 Days", daysToExpire<120 AND daysToExpire>=90, "90-120 Days", daysToExpire<90 AND daysToExpire>=60, "60-90 Days", daysToExpire<60 AND daysToExpire>=30, "30-60 Days", daysToExpire<30 AND daysToExpire>0, "Less than 30 Days", daysToExpire<=0, "Expired") | dedup Thumbprint\
| sort +daysToExpire | stats count by timeRange | rename count AS "Number of CAs" timeRange AS "Time Range"

[Whitelist/Blacklist/Graylist]
display.general.timeRangePicker.show = 0
display.page.search.mode = fast
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 \
| lookup "CA Whitelist" Good_Thumbprint AS Thumbprint OUTPUTNEW Good_Thumbprint AS white | lookup "CA Blacklist" Bad_Thumbprint AS Thumbprint OUTPUTNEW Bad_Thumbprint AS black \
| eval Status=case(isnotnull(white) AND isnull(black), "White", isnull(white) AND isnotnull(black), "Black", isnull(white) AND isnull(black), "Gray", isnotnull(white) AND isnotnull(black), "Appears in Whitelist and Blacklist") \
| dedup Thumbprint\
| table Thumbprint, ssl_issuer, ssl_subject, Status | rename ssl_issuer AS Issuer ssl_subject AS Subject

[CA Algorithms - Data Model Accelerated]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = | tstats dc(X509_Certificate_Standard.Thumbprint) AS dcount FROM datamodel=Certificate_Authorities where earliest=-7d (X509_Certificate_Standard.StoreName="CA" OR X509_Certificate_Standard.StoreName="Root" OR X509_Certificate_Standard.StoreName="AuthRoot") X509_Certificate_Standard.Certificate_Authority_Stores.Expired=False by X509_Certificate_Standard.ssl_signature_algorithm X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Key_Size | xyseries X509_Certificate_Standard.ssl_signature_algorithm X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Key_Size dcount | rename X509_Certificate_Standard.Certificate_Authority_Stores.Normalized_Key_Size AS "Key Size" dcount AS "Number of CAs" X509_Certificate_Standard.ssl_signature_algorithm AS "Signature Algorithm"

[Validity of Intermediate CAs by Country]
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.track = 0
display.events.fields = ["host","source","sourcetype","VerificationErrorFlags"]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
request.ui_dispatch_app = casa
request.ui_dispatch_view = search
search = tag=certificate_index tag=certificate_source hoursago=168 | where PSParentPath="Microsoft.PowerShell.Security\Certificate::LocalMachine\CA" | eval ed1=strptime(ssl_start_time, "%m/%d/%Y %I:%M:%S %p") | eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | eval period=ed2-ed1 | eval yearsOfValidity=ceil(period/31536000) | where timeDiff>0 AND yearsOfValidity>10 | rex field=ssl_issuer "C=(?<Country>[a-zA-Z]*)" | eval Country=coalesce(upper(Country), "UNKNOWN") | chart dc(Thumbprint) by Country, yearsOfValidity | rename dc(Thumbprint) AS "Number of CAs" yearsOfValidity AS "Years of Validity" ssl_start_time AS "Date of Validity" ssl_end_time AS "Date of Expiration"

[Status of Trusted CAs]
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = bar
display.visualizations.show = 1
search = tag=certificate_index tag=certificate_source tag=certificate_authority hoursago=168 \
| eval ed2=strptime(ssl_end_time, "%m/%d/%Y %I:%M:%S %p") | eval now=now() | eval timeDiff=ed2-now | where timeDiff>0 \
| lookup "CA Whitelist" Good_Thumbprint AS Thumbprint OUTPUTNEW Good_Thumbprint AS white | lookup "CA Blacklist" Bad_Thumbprint AS Thumbprint OUTPUTNEW Bad_Thumbprint AS black\
| eval Status=case(isnotnull(white) AND isnull(black), "White", isnull(white) AND isnotnull(black), "Black", isnull(white) AND isnull(black), "Gray", isnotnull(white) AND isnotnull(black), "Appears in Whitelist and Blacklist") \
| stats dc(Thumbprint) AS "Number of CAs" by Status
